app/views/home/index.html.erb

    <%= link_to "Criar Nova Árvore", new_tree_path, class: "w-full sm:w-auto text-center bg-indigo-500 hover:bg-indigo-600 text-white font-medium py-3 px-6 rounded-md transition-colors duration-200" %>
    <% if user_signed_in? && current_user.trees.any? %>
      <%= link_to "Minha Última Árvore", current_user.trees.first, class: "w-full sm:w-auto text-center bg-white border border-gray-300 hover:bg-gray-50 text-gray-700 font-medium py-3 px-6 rounded-md transition-colors duration-200" %>
---
SELECT "trees".* FROM "trees" WHERE "trees"."user_id" = 1 ORDER BY "trees"."id" ASC LIMIT 1
SELECT 1 AS one FROM "trees" WHERE "trees"."user_id" = 1 LIMIT 1


  <% if user_signed_in? && current_user.trees.any? %>
---
SELECT 1 AS one FROM "trees" WHERE "trees"."user_id" = 1 LIMIT 1

      <ul class="space-y-2">
        <% current_user.trees.each do |tree| %>
---
SELECT "trees".* FROM "trees" WHERE "trees"."user_id" = 1