app/controllers/trees_controller.rb

  def create
    # @tree = Tree.new(tree_params)
    @tree = current_user.trees.build(tree_params)

    respond_to do |format|
      if @tree.save
---
INSERT INTO "trees" ("name", "instagram", "x", "youtube", "user_id", "style", "created_at", "updated_at", "slug") VALUES ('pinot', 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', 2, 'minimalistic', '2025-03-17 17:52:39.934872', '2025-03-17 17:52:39.934872', 'pinot') RETURNING "id"

  def update
    respond_to do |format|
      if @tree.update(tree_params)
---
UPDATE "trees" SET "instagram" = 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', "x" = 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', "youtube" = 'text-gray-600 hover:text-gray-900 hover:bg-gray-100 rounded-md px-4 py-2 text-sm transition-colors duration-200', "style" = 'classic', "updated_at" = '2025-03-17 17:52:22.528784' WHERE "trees"."id" = 5

  def destroy
    @tree.destroy!
---
DELETE FROM "trees" WHERE "trees"."id" = 7

    def set_tree
      # @tree = Tree.find(params.expect(:id))
      @tree = Tree.friendly.find(params[:id])
---
SELECT "trees".* FROM "trees" WHERE "trees"."id" = 5 LIMIT 1